Repository: wbonbon/OverlayPlugin
Catalog: OverlayPlugin.Updater/Resources.*.resx
Languages: de_de, zh_cn

# UpdateCheckException
source: Failed to check for updates: {0}
de_de: Fehler beim Suchen nach Updates: {0}
zh_cn: 检查更新失败: {0}

# ErrorTitle
source: {0} Error
de_de: {0}-Fehler
zh_cn: {0} 错误

# LogRetry
source: Trying again...
de_de: Erneuter Versuch ...
zh_cn: 正在重试...

# UpdateFailedError
source: Failed to update the plugin. It might not load the next time you start ACT. Retry?
de_de: Das Plugin konnte nicht aktualisiert werden. Beim nächsten Start von ACT wird es möglicherweise nicht geladen. Wiederholen?
zh_cn: 插件更新失败。下次运行 ACT 时将不会加载本插件。重试?

# LogDownloadFailed
source: Download failed: {0}
de_de: Download fehlgeschlagen: {0}
zh_cn: 下载失败: {0}

# MsvcrtFailed
source: The MSVCRT installation failed.
de_de: Die MSVCRT-Installation ist fehlgeschlagen.
zh_cn: MSVCRT 安装失败。

# StatusError
source: Error
de_de: Fehler
zh_cn: 错误

# LogResumingDownload
source: Resuming download...
de_de: Download fortsetzen ...
zh_cn: 正在恢复下载...

# LaunchingInstallerFailed
source: Failed to launch installer: {0}
de_de: Installationsprogramm konnte nicht gestartet werden: {0}
zh_cn: 打开安装程序失败: {0}

# LogOpeningArchive
source: Opening archive...
de_de: Archiv öffnen ...
zh_cn: 正在打开压缩包...

# StatusPreparingExtraction
source: [{0}/{1}]: Preparing extraction...
de_de: [{0}/{1}]: Extraktion vorbereiten ...
zh_cn: [{0}/{1}]: 正在准备解压缩...

# DownloadFailedContentLengthMissing
source: Download failed! The download has no file size (Content-Length header is missing).
de_de: Download fehlgeschlagen! Der Download hat keine Dateigröße (Content-Length-Header fehlt).
zh_cn: 下载失败! 丢失下载文件大小 (Content-Length 标头缺失)。

# UpdateParseVersionError
source: Failed to parse version: {0}
de_de: Version konnte nicht analysiert werden: {0}
zh_cn: 解析版本失败 (国服玩家无须在意, 直接关闭): {0}

# LogInstallerFailed
source: Error: The installer did not finish correctly.
de_de: Fehler: Das Installationsprogramm wurde nicht korrekt beendet.
zh_cn: 错误: 安装程序未正确完成。

# LogAbortedByUser
source: Aborted by user.
de_de: Vom Benutzer abgebrochen.
zh_cn: 用户已终止。

# StatusDownloadStarted
source: [{0}/{1}]: Downloading...
de_de: [{0}/{1}]: Download wird gestartet ...
zh_cn: [{0}/{1}]: 下载中...

# LogRetryAfter1s
source: Retrying in 1 second.
de_de: In einer Sekunde wiederholen.
zh_cn: 1秒后重试。

# StatusDone
source: [{0}/{1}]: Done.
de_de: [{0}/{1}]: Fertig.
zh_cn: [{0}/{1}]: 已完成。

# LogExtractionAbortedByUser
source: Extraction aborted by user.
de_de: Extraktion vom Benutzer abgebrochen.
zh_cn: 解压缩被用户终止。

# UpdateCheckTitle
source: {0} Update Check
de_de: {0} Update Überprüfung
zh_cn: {0} 检查更新

# UpdateCefDlFailed
source: Failed to download CEF! Check the OverlayPlugin.dll tab for details.
de_de: CEF konnte nicht heruntergeladen werden! Überprüfe den OverlayPlugin.dll Tab für Details
zh_cn: 下载 CEF 失败!查看 "OverlayPlugin悬浮窗插件" 选项卡获取详细信息。

# Exception
source: Failed: {0}
de_de: Fehlgeschlagen: {0}
zh_cn: 异常: {0}

# LogLaunchingInstaller
source: Launching installer...
de_de: Installer starten ...
zh_cn: 正在运行安装程序...

# LogInstallerWaiting
source: Waiting for installer to exit...
de_de: Warten auf das Beenden des Installationsprogramms ...
zh_cn: 正在等待安装程序退出...

source: Out of retries.
de_de: Keine Wiederholungsversuche mehr.
zh_cn: 超过重试次数。

# StatusLaunchingInstaller
source: [{0}/{1}]: Launching installer...
de_de: [{0}/{1}]: Installationsprogramm wird gestartet ...
zh_cn: [{0}/{1}]: 正在运行安装程序...。

# LogDownloading
source: Downloading "{0}" into {1}...
de_de: Herunterladen von "{0}" nach {1} ...
zh_cn: 正在下载 "{0}" 至 {1}...

# StatusCancelling
source: Cancelling...
de_de: Abbrechen ...
zh_cn: 正在取消...

# MsvcrtMissing
source: You're missing the MS Visual C++ Redistributable for Visual Studio 2019. You'll need that for OverlayPlugin. Install it now?
de_de: MS Visual C ++ Redistributable für Visual Studio 2019 fehlt. Es wird zwingend benötigt für das OverlayPlugin. Jetzt installieren?
zh_cn: 你没有安装微软公司适用于 Visual Studio 2019 的 Visual C++ 可再发行程序包。 OverlayPlugin 需要此运行库。现在安装?

# CreatingTempDirFailed
source: Failed to create or empty the temporary directory "{0}": {1}
de_de: Fehler beim Erstellen oder Leeren des temporären Verzeichnisses "{0}": {1}
zh_cn: 创建或清空缓存目录 "{0}" 失败。 {1}

# UpdateTitle
source: {0} Update
zh_cn: {0} 更新

# StatusCancelled
source: Cancelled!
de_de: Abgebrochen!
zh_cn: 已取消!

# LogExtractingFiles
source: Extracting files...
de_de: Dateien extrahieren ...
zh_cn: 正在解压文件...

# UpdateAlreadyLatest
source: You are already on the latest version.
de_de: Sie sind bereits auf der neuesten Version.
zh_cn: 你使用的是最新版本。

# LogDownloadInterrupted
source: The download was interrupted: {0}
de_de: Der Download wurde unterbrochen: {0}
zh_cn: 下载被中断。 {0}

# UpdateSuccess
source: The update was successful. Please restart ACT to load the new plugin version.
de_de: Das Update war erfolgreich. Bitte starten Sie ACT neu, um die neue Plugin-Version zu laden.
zh_cn: 更新成功。请重新启动 ACT 以加载新版插件。

# LogBackingUpOldFiles
source: Backing up old files...
de_de: Alte Dateien sichern ...
zh_cn: 正在备份旧文件...

# LogRemovingOldBackup
source: Removing old backup directory...
de_de: Altes Sicherungsverzeichnis entfernen ...
zh_cn: 正在删除旧备份目录...

# LogOverwritingOldFiles
source: Overwriting old files...
de_de: Alte Dateien überschreiben ...
zh_cn: 正在替换旧文件...

# LogRestoringBackup
source: Restoring backup...
de_de: Sicherung wiederherstellen ...
zh_cn: 正在恢复备份...

# LogDone
source: Done.
de_de: Fertig.
zh_cn: 完成。

# LogFailedReplaceDirectory
source: Failed to replace old directory: {0}
de_de: Altes Verzeichnis konnte nicht ersetzt werden: {0}
zh_cn: 无法替换旧目录。 {0}

# LogMovingDirectory
source: Moving directory...
de_de: Verzeichnis verschieben ...
zh_cn: 正在移动目录...

# LogDeletingTempFiles
source: Deleting temporary files...
de_de: Temporäre Dateien löschen ...
zh_cn: 正在删除临时文件...

# LogFailedToDelete
source: Failed to delete {0}: {1}
de_de: Fehler beim Löschen von {0}: {1}
zh_cn: 无法删除 {0}。 {1}

# LogCleaningUp
source: Cleaning up...
de_de: Aufräumen ...
zh_cn: 正在执行清理...

# LogOverwritingOldFilesFailed
source: Failed to overwrite old files: {0} WARNING: The plugin might be in an unusable state!! Run the update check again or reinstall the plugin, otherwise it might not survive the next ACT restart.
de_de: Fehler beim Überschreiben alter Dateien: {0} WARNUNG: Das Plugin befindet sich möglicherweise in einem unbrauchbaren Zustand!! Führen Sie die Aktualisierungsprüfung erneut aus oder installieren Sie das Plugin erneut, da es den nächsten ACT-Neustart möglicherweise nicht übersteht.
zh_cn: 无法替换旧文件: {0} 警告: 插件可能处于无法使用的状态!! 再次运行更新检查或重新安装插件, 否则可能在下次 ACT 重新启动时无法正常工作。

# SharpCompressOutdatedError
source: The currently loaded version of SharpCompress is outdated! Make sure you load OverlayPlugin before any other plugins that also use SharpCompress (like ACTWebSocket).
de_de: Die aktuell geladene Version von SharpCompress ist veraltet! Stellen Sie sicher, dass Sie OverlayPlugin vor allen anderen Plugins laden, die ebenfalls SharpCompress verwenden (wie ACTWebSocket).
zh_cn: 当前加载的 SharpCompress 版本过旧! 请确保先加载 OverlayPlugin, 再加载其他也使用 SharpCompress 的插件 (如ACTWebSocket)。

# ActUpdateException
source: ACT Update check for {0} failed, falling back to GitHub API: {1}
de_de: ACT Update-Überprüfung für {0} ist fehlgeschlagen, greife auf GitHub API zurück: {1}
zh_cn: 通过 ACT 检查 {0} 的更新失败, 正在回退至 GitHub API。 {1}

# ActUpdateCheckFailed
source: Update check for {0} through ACT failed, retrying with GitHub API.
de_de: Update-Überprüfung für {0} durch ACT ist fehlgeschlagen, neuer Versuch per GitHub API.
zh_cn: 通过 ACT 检查 {0} 的更新失败, 正在调用 GitHub API 重试。

# UpdateSliderDetails
source: {0} was updated successfully.
de_de: {0} wurde erfolgreich geupdatet.
zh_cn: {0} 已更新成功。

# LogOverwriteRetry
source: Failed to overwrite {0}, retrying... {1}
zh_cn: 替换 {0} 文件失败, 正在重试... {1}

# LogOverwriteFailed
source: No retries left, update failed.
zh_cn: 超过重试次数, 更新失败。

# IgnoreUpdateDueToDotGitDirectoryMessage
source: Ignoring auto-update due to OverlayPlugin being a .git repo.
zh_cn: 由于 OverlayPlugin 文件夹是 git 本地仓库, 跳过自动更新。
